In [ ]:
pip install pandas

In [15]:
import os
import pandas as pd
import numpy as np

Data Preprocessing

In [40]:
pop = pd.read_csv('C:/users/bakin/desktop/population_total.csv')
ley = pd.read_csv('C:/Users/bakin/Desktop/life_expectancy_years.csv')
gni = pd.read_csv('C:/Users/bakin/Desktop/gnipercapita_ppp_current_international.csv')

In [22]:
pop.head()

,country,1800,1801,1802,1803,1804,1805,1806,1807,1808,...,2091,2092,2093,2094,2095,2096,2097,2098,2099,2100
0,Afghanistan,3280000,3280000,3280000,3280000,3280000,3280000,3280000,3280000,3280000,...,76600000,76400000,76300000,76100000,76000000,75800000,75600000,75400000,75200000,74900000
1,Albania,400000,402000,404000,405000,407000,409000,411000,413000,414000,...,1330000,1300000,1270000,1250000,1220000,1190000,1170000,1140000,1110000,1090000
2,Algeria,2500000,2510000,2520000,2530000,2540000,2550000,2560000,2560000,2570000,...,70400000,70500000,70500000,70600000,70700000,70700000,70700000,70700000,70700000,70700000
3,Andorra,2650,2650,2650,2650,2650,2650,2650,2650,2650,...,63000,62900,62900,62800,62700,62700,62600,62500,62500,62400
4,Angola,1570000,1570000,1570000,1570000,1570000,1570000,1570000,1570000,1570000,...,168000000,170000000,172000000,175000000,177000000,179000000,182000000,184000000,186000000,188000000

In [23]:
ley.head(5)

,country,1800,1801,1802,1803,1804,1805,1806,1807,1808,...,2091,2092,2093,2094,2095,2096,2097,2098,2099,2100
0,Afghanistan,28.2,28.2,28.2,28.2,28.2,28.2,28.1,28.1,28.1,...,76.5,76.6,76.7,76.9,77.0,77.1,77.3,77.4,77.5,77.7
1,Albania,35.4,35.4,35.4,35.4,35.4,35.4,35.4,35.4,35.4,...,87.4,87.5,87.6,87.7,87.8,87.9,88.0,88.1,88.2,88.3
2,Algeria,28.8,28.8,28.8,28.8,28.8,28.8,28.8,28.8,28.8,...,88.3,88.4,88.5,88.6,88.7,88.8,88.9,89.0,89.1,89.2
3,Andorra,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Angola,27.0,27.0,27.0,27.0,27.0,27.0,27.0,27.0,27.0,...,78.7,78.9,79.0,79.1,79.3,79.4,79.5,79.7,79.8,79.9

In [24]:
gni.head(5)

,country,1990,1991,1992,1993,1994,1995,1996,1997,1998,...,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
0,Afghanistan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,1710.0,1700.0,1920.0,2020.0,2070.0,2110.0,2150.0,2230.0,2260.0,2330.0
1,Albania,2550.0,1880.0,1740.0,2110.0,2300.0,2710.0,3050.0,2780.0,3110.0,...,9540.0,10200.0,10500.0,10800.0,11400.0,11800.0,12200.0,13100.0,13800.0,14400.0
2,Algeria,6660.0,6510.0,6690.0,6630.0,6530.0,6710.0,6980.0,7120.0,7490.0,...,13100.0,13400.0,13100.0,12800.0,12700.0,11700.0,11500.0,11400.0,11500.0,11500.0
3,Angola,2980.0,3300.0,1620.0,1490.0,1260.0,2340.0,2410.0,2820.0,2810.0,...,5950.0,6130.0,6810.0,7130.0,7680.0,6960.0,6730.0,6860.0,6550.0,6390.0
4,Antigua and Barbuda,10500.0,11300.0,11600.0,12400.0,13200.0,12600.0,13500.0,14300.0,14900.0,...,20100.0,19700.0,19000.0,18200.0,18100.0,17900.0,18400.0,18900.0,20500.0,21500.0

1. The data contains missing values. For all three CSVs, use forward filling for imputing the missing data. Forward filling uses earlier values of the country for filling later ones (tip: there exist a Pandas function for that)

In [41]:
print(gni.isnull().sum().sum())
print(ley.isnull().sum().sum())
print(pop.isnull().sum().sum())

348
759
0

In [42]:
ley.ffill(inplace=True)
gni.ffill(inplace=True)
gni.backfill(inplace=True)

In [43]:
print(gni.isnull().sum().sum())
print(ley.isnull().sum().sum())
print(pop.isnull().sum().sum())

0
0
0

In [44]:
gni.head(5)

,country,1990,1991,1992,1993,1994,1995,1996,1997,1998,...,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
0,Afghanistan,2550.0,1880.0,1740.0,2110.0,2300.0,2710.0,3050.0,2780.0,3110.0,...,1710.0,1700.0,1920.0,2020.0,2070.0,2110.0,2150.0,2230.0,2260.0,2330.0
1,Albania,2550.0,1880.0,1740.0,2110.0,2300.0,2710.0,3050.0,2780.0,3110.0,...,9540.0,10200.0,10500.0,10800.0,11400.0,11800.0,12200.0,13100.0,13800.0,14400.0
2,Algeria,6660.0,6510.0,6690.0,6630.0,6530.0,6710.0,6980.0,7120.0,7490.0,...,13100.0,13400.0,13100.0,12800.0,12700.0,11700.0,11500.0,11400.0,11500.0,11500.0
3,Angola,2980.0,3300.0,1620.0,1490.0,1260.0,2340.0,2410.0,2820.0,2810.0,...,5950.0,6130.0,6810.0,7130.0,7680.0,6960.0,6730.0,6860.0,6550.0,6390.0
4,Antigua and Barbuda,10500.0,11300.0,11600.0,12400.0,13200.0,12600.0,13500.0,14300.0,14900.0,...,20100.0,19700.0,19000.0,18200.0,18100.0,17900.0,18400.0,18900.0,20500.0,21500.0

In [45]:
ley.head(5)

,country,1800,1801,1802,1803,1804,1805,1806,1807,1808,...,2091,2092,2093,2094,2095,2096,2097,2098,2099,2100
0,Afghanistan,28.2,28.2,28.2,28.2,28.2,28.2,28.1,28.1,28.1,...,76.5,76.6,76.7,76.9,77.0,77.1,77.3,77.4,77.5,77.7
1,Albania,35.4,35.4,35.4,35.4,35.4,35.4,35.4,35.4,35.4,...,87.4,87.5,87.6,87.7,87.8,87.9,88.0,88.1,88.2,88.3
2,Algeria,28.8,28.8,28.8,28.8,28.8,28.8,28.8,28.8,28.8,...,88.3,88.4,88.5,88.6,88.7,88.8,88.9,89.0,89.1,89.2
3,Andorra,28.8,28.8,28.8,28.8,28.8,28.8,28.8,28.8,28.8,...,88.3,88.4,88.5,88.6,88.7,88.8,88.9,89.0,89.1,89.2
4,Angola,27.0,27.0,27.0,27.0,27.0,27.0,27.0,27.0,27.0,...,78.7,78.9,79.0,79.1,79.3,79.4,79.5,79.7,79.8,79.9

2. For each CSV, transform the dataframe into a so called "tidy data format" (see e.g. https://en.wikipedia.org/wiki/Tidy_data). Each dataframe then should have only three columns: (1) country, (2) year, (3) the KPI (that means either a) life expectancy, b) population, or 3) GNI per capita)

In [52]:
gni_ty = pd.melt(gni, ["country"], var_name="year", value_name="GNI per capita")
pop_ty = pd.melt(pop, ["country"], var_name="year", value_name="population")
ley_ty = pd.melt(ley, ["country"], var_name="year", value_name="life expectancy")

In [49]:
gni_ty.head(5)

               country  year  GNI per capita
0          Afghanistan  1990          2550.0
1              Albania  1990          2550.0
2              Algeria  1990          6660.0
3               Angola  1990          2980.0
4  Antigua and Barbuda  1990         10500.0

In [50]:
pop_ty.head(5)

       country  year  population
0  Afghanistan  1800     3280000
1      Albania  1800      400000
2      Algeria  1800     2500000
3      Andorra  1800        2650
4       Angola  1800     1570000

In [53]:
ley_ty.head(5)

       country  year  life expectancy
0  Afghanistan  1800             28.2
1      Albania  1800             35.4
2      Algeria  1800             28.8
3      Andorra  1800             28.8
4       Angola  1800             27.0

3. You have to merge all three CVS. Merge the three dataframe into one dataframe, that just has 5 columns (country, year and all three KPIs from the three dataframes)

In [65]:
ley_gni_ty = pd.merge(ley_ty, gni_ty, how= 'left', on=['country', 'year'])
ley_gni_ty.head(5)

       country  year  life expectancy  GNI per capita
0  Afghanistan  1800             28.2             NaN
1      Albania  1800             35.4             NaN
2      Algeria  1800             28.8             NaN
3      Andorra  1800             28.8             NaN
4       Angola  1800             27.0             NaN

In [67]:
merged_ty = pd.merge(ley_gni_ty, pop_ty, how= 'left', on=['country', 'year'])
merged_ty.head(5)

       country  year  life expectancy  GNI per capita  population
0  Afghanistan  1800             28.2             NaN     3280000
1      Albania  1800             35.4             NaN      400000
2      Algeria  1800             28.8             NaN     2500000
3      Andorra  1800             28.8             NaN        2650
4       Angola  1800             27.0             NaN     1570000